inputted = input('Введите строку, которую вы хотели бы перевести в транслит: ')

dictionary = {'а':'a', 'А':'A',
              'б':'b', 'Б':'B',
              'в':'v', 'В':'V',
              'г':'g', 'Г':'G',
              'д':'d', 'Д':'D',
              'е':'e','Е':'E',
              'ё':'yo', 'Ё':'Yo',
              'ж':'zh', 'Ж':'Zh',
              'з':'z', 'З':'Z',
              'и':'i', 'И':'I',
              'й':'i', 'Й':'I',
              'к':'k', 'К':'K',
              'л':'l', 'Л':'L',
              'м':'m', 'М':'M',
              'н':'n', 'Н':'N',
              'о':'o', 'О':'O',
              'п':'p', 'П':'P',
              'р':'r', 'Р':'R',
              'с':'s', 'С':'S',
              'т':'t', 'Т':'T',
              'у':'u', 'У':'U',
              'ф':'f', 'Ф':'F',
              'х':'h',  'Х':'H',
              'ц':'ts', 'Ц':'Ts',
              'ч':'ch', 'Ч':'Ch',
              'ш':'sh', 'Ш':'Sh',
              'щ':'shich', 'Щ':'Shich',
              'ы':'y', 'Ы':'Y',
              'ю':'yu', 'Ю':'Yu',
              'я':'ya', 'Я':'Ya',
              'ъ':'', 'Ъ':'',
              'ь':'', 'Ь':'',
              'э':'e', 'Э':'E',
              }

simv_list = ["'", "\"", ",", " ", "?", "!", ">",
             "<","[", "]", "{", "}", "-", "+",
             "=", "(", ")", "#", "@", "$",
             ";", "%", "&", "^", "*",
             "/", "\\", "|", "~", "`"]

t_inputed = ''

for i in inputted:
    if i in dictionary:
        i = dictionary[i]
        t_inputed += i
    elif i in simv_list:
        t_inputed += i
    elif i.isalpha():
        t_inputed += i
    elif i.isdigit():
        t_inputed += i
    else:
        continue

print('В транслите строка будет выглядеть так: ', t_inputed)
